from django.utils.translation import ugettext_lazy as _

CUSTOM_MESSAGES = {
    'EMAIL_DUPLICATE': _('Նշված E-mail դաշտով օգտատեր արդեն գոյություն ունի'),
    'USER_WITH_LOGIN_NOT_FOUND': _('Սխալ Էլ. հասցե կամ գաղտնաբառ, խնդրում ենք փորձեք կրկին:'),
    'REQUIRED_PHONE_VERIFICATION': _('Մուտք գործելու համար անհրաժեշտ է հաստատել Ձեր հեռախոսահամարը'),
    'REQUIRED_EMAIL_VERIFICATION': _('Մուտք գործելու համար անհրաժեշտ է հաստատել Ձեր E-mail -ը'),
    'USER_NOT_FOUND': _('Օգտատերը չի գտնվել'),
    'USER_CREATED': _(
        'Շնորհակալություն գրանցման համար:<br>Խնդրում ենք հաստատեք Ձեր Email -ը գրանցումն ավարտելու համար:'),
    'USED_LINK': _('Հղումն արդեն օգտագործվել է: '),
    'INVALID_DATA': _('Տվյալների մշակման սխալ։ Փորձեք նորից գրանցվել։ '),
    "PROFILE_ACTIVATED": _('Շնորհակալություն գրանցվելու  համար: <br> \n Ձեր պրոֆիլը հաջողությամբ ակտիվացվել է։'),
    "RESET_SUCCESS": _('<b>Գաղտաբառի վերականգնման նամակն ուղարկվել է:</b><br>Ձեր \
                                    Email -ին ուղարկվել են գաղտնաբառի վերականգնման կարգավորումները: Դուք շուտով \
                                    կստանաք այն: Եթե Դուք չեք ստացել էլ. նամակ, խնդրում ենք համոզվել, որ \
                                    մուտքագրել եք հենց այն Email -ը, որն օգտագործել եք մեր կայքում գրանցվելու \
                                    համար:<br>Խնդրում ենք ստուգել նաև «սպամ» թղթապանակը։ '),
    'PASSWORD_UPDATE_SUCCESS': _("Գաղտնաբառը հաջողությամբ թարմացվել է։ "),
    'PASSWORD_MISS_MATCH': _("Գաղտնաբառերը չեն համապատասխանում: "),
    'INVALID_LOGIN_OR_PASSWORD': _('Սխալ մուտքանուն կամ գաղտնաբառ։'),
    'WRONG_OLD_PASSWORD': _('Հին գաղտնաբառը սխալ է մուտքագրված։ '),
    'SUCCESS_UPDATE_PASSWORD': _('Գաղտնաբառը հաջողությամբ թարմացվել է։ '),
    'DATETIME_ERROR': _('Խնդրում ենք ստուգել ամսաթվի ճշտությունը'),
    'UPDATE_PERSONAL_DATA_SUCCESS': _('Տվյալները հաջողությամբ թարմացվել են'),
    'SMTH_WENT_WRONG': _('Տեղի է ունեցել սխալ: Խնդրում ենք փորձել կրկին'),
    'EMAIL_NOT_FOUND': _('Տվյալ մուտքանունով օգտատեր չի գտնվել։'),
    'VERIFY_EMAIL': _("Խնդրում ենք հաստատել Ձեր Email հասցեն գործողությունները շարունակելու համար։")
}
